In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("Churn_Modelling.csv")

In [6]:
print(df)

      RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  \
0             1    15634602   Hargrave          619    France  Female   42
1             2    15647311       Hill          608     Spain  Female   41
2             3    15619304       Onio          502    France  Female   42
3             4    15701354       Boni          699    France  Female   39
4             5    15737888   Mitchell          850     Spain  Female   43
...         ...         ...        ...          ...       ...     ...  ...
9995       9996    15606229   Obijiaku          771    France    Male   39
9996       9997    15569892  Johnstone          516    France    Male   35
9997       9998    15584532        Liu          709    France  Female   36
9998       9999    15682355  Sabbatini          772   Germany    Male   42
9999      10000    15628319     Walker          792    France  Female   28

      Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0          2       0.00              1          1               1
1          1   83807.86              1          0               1
2          8  159660.80              3          1               0
3          1       0.00              2          0               0
4          2  125510.82              1          1               1
...      ...        ...            ...        ...             ...
9995       5       0.00              2          1               0
9996      10   57369.61              1          1               1
9997       7       0.00              1          0               1
9998       3   75075.31              2          1               0
9999       4  130142.79              1          1               0

      EstimatedSalary  Exited
0           101348.88       1
1           112542.58       0
2           113931.57       1
3            93826.63       0
4            79084.10       0
...               ...     ...
9995         96270.64       0
9996        101699.77       0
9997         42085.58       1
9998         92888.52       1
9999         38190.78       0

[10000 rows x 14 columns]

In [9]:
# to get a glimpse of data we use tail and head
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [10]:
df.tail() # last rows

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [ ]:
df.info() #.info() function is the best fun to understand dataset.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [ ]:
# .describe() -> gives statistical info about numerical columns i.e. mean, median, mode, std
df.describe()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,10000.00000,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,5000.50000,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,2886.89568,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.00000,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,2500.75000,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,5000.50000,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,7500.25000,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,10000.00000,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [13]:
# printing all the colums
print(df.columns)

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [17]:
# sorting data frame based on age.
df = df.sort_values('Age')
print(df.head(30).T)

                      1678      4556         9520             9526      9572  \
RowNumber             1679      4557         9521             9527      9573
CustomerId        15569178  15796231     15673180         15665521  15641688
Surname          Kharlamov   Nwankwo  Onyekaozulu  Chiazagomekpele   Collier
CreditScore            570       681          727              642       644
Geography           France    France      Germany          Germany     Spain
Gender              Female    Female       Female             Male      Male
Age                     18        18           18               18        18
Tenure                   4         1            2                5         7
Balance           82767.42  98894.39      93816.7        111183.53       0.0
NumOfProducts            1         1            2                2         1
HasCrCard                1         1            1                0         0
IsActiveMember           0         1            0                1         1
EstimatedSalary    71811.9    9596.4    126172.11         10063.75  59645.24
Exited                   0         0            0                0         1

                      2021      2141       2136       1619      4716  ...  \
RowNumber             2022      2142       2137       1620      4717  ...
CustomerId        15795519  15758372   15621893   15770309  15805764  ...
Surname           Vasiliev   Wallace   Bellucci   McDonald  Hallahan  ...
CreditScore            716       674        727        656       646  ...
Geography          Germany    France     France     France    France  ...
Gender              Female      Male       Male       Male      Male  ...
Age                     18        18         18         18        18  ...
Tenure                   3         7          4         10        10  ...
Balance           128743.8       0.0  133550.67  151762.74       0.0  ...
NumOfProducts            1         2          1          1         2  ...
HasCrCard                0         1          1          0         0  ...
IsActiveMember           0         1          1          1         1  ...
EstimatedSalary  197322.13  55753.12   46941.41  127014.32  52795.15  ...
Exited                   0         1          0          0         0  ...

                     8522      7334      2990       3631       6319  \
RowNumber            8523      7335      2991       3632       6320
CustomerId       15619892  15759133  15809823   15794841   15768340
Surname              Page   Vaguine  Thurgood       Kung    Beavers
CreditScore           644       616       491        739        642
Geography           Spain    France   Germany      Spain    Germany
Gender               Male      Male      Male       Male     Female
Age                    18        18        19         19         19
Tenure                  8         6         2          5          3
Balance               0.0       0.0  125860.2   89750.21  113905.48
NumOfProducts           2         2         1          1          1
HasCrCard               1         1         0          1          1
IsActiveMember          0         1         0          0          1
EstimatedSalary  59172.42  27308.58  129690.5  193008.52   176137.2
Exited                  0         0         0          0          0

                      3999      4727       6003       923       6887
RowNumber             4000      4728       6004        924      6888
CustomerId        15665062  15641822   15579892   15601026  15662641
Surname           Lucchese    Barese      Doyle  Gallagher     Amadi
CreditScore            696       648        708        572       850
Geography           France    France      Spain    Germany    France
Gender                Male    Female       Male     Female      Male
Age                     19        19         19         19        19
Tenure                   1         1          7          1         8
Balance          110928.51       0.0  112615.86  138657.08       0.0
NumOfProducts            1         2          1          1         1
HasCrCard                1         0          1          1         1
IsActiveMember           1         1          1          1         1
EstimatedSalary    2766.63  22101.86    4491.77   16161.82  68569.89
Exited                   0         0          0          0         0

[14 rows x 30 columns]

In [19]:
#print a specific column
print(df["Gender"].head(10))

1678    Female
4556    Female
9520    Female
9526      Male
9572      Male
2021    Female
2141      Male
2136      Male
1619      Male
4716      Male
Name: Gender, dtype: object

In [20]:
print(df['Balance'].head(10))

1678     82767.42
4556     98894.39
9520     93816.70
9526    111183.53
9572         0.00
2021    128743.80
2141         0.00
2136    133550.67
1619    151762.74
4716         0.00
Name: Balance, dtype: float64

In [25]:
#creating a new colum
df['New Balance']=df['Balance'] + 1000
print(df.head(10))

      RowNumber  CustomerId          Surname  CreditScore Geography  Gender  \
1678       1679    15569178        Kharlamov          570    France  Female
4556       4557    15796231          Nwankwo          681    France  Female
9520       9521    15673180      Onyekaozulu          727   Germany  Female
9526       9527    15665521  Chiazagomekpele          642   Germany    Male
9572       9573    15641688          Collier          644     Spain    Male
2021       2022    15795519         Vasiliev          716   Germany  Female
2141       2142    15758372          Wallace          674    France    Male
2136       2137    15621893         Bellucci          727    France    Male
1619       1620    15770309         McDonald          656    France    Male
4716       4717    15805764         Hallahan          646    France    Male

      Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
1678   18       4   85767.42              1          1               0
4556   18       1  101894.39              1          1               1
9520   18       2   96816.70              2          1               0
9526   18       5  114183.53              2          0               1
9572   18       7    3000.00              1          0               1
2021   18       3  131743.80              1          0               0
2141   18       7    3000.00              2          1               1
2136   18       4  136550.67              1          1               1
1619   18      10  154762.74              1          0               1
4716   18      10    3000.00              2          0               1

      EstimatedSalary  Exited  New Balance
1678         71811.90       0     86767.42
4556          9596.40       0    102894.39
9520        126172.11       0     97816.70
9526         10063.75       0    115183.53
9572         59645.24       1      4000.00
2021        197322.13       0    132743.80
2141         55753.12       1      4000.00
2136         46941.41       0    137550.67
1619        127014.32       0    155762.74
4716         52795.15       0      4000.00

In [26]:
df.drop(columns=['New Balance'])

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
1678,1679,15569178,Kharlamov,570,France,Female,18,4,85767.42,1,1,0,71811.90,0
4556,4557,15796231,Nwankwo,681,France,Female,18,1,101894.39,1,1,1,9596.40,0
9520,9521,15673180,Onyekaozulu,727,Germany,Female,18,2,96816.70,2,1,0,126172.11,0
9526,9527,15665521,Chiazagomekpele,642,Germany,Male,18,5,114183.53,2,0,1,10063.75,0
9572,9573,15641688,Collier,644,Spain,Male,18,7,3000.00,1,0,1,59645.24,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3531,3532,15653251,Hickey,408,France,Female,84,8,90873.39,1,0,0,188484.52,1
3033,3034,15578006,Yao,787,France,Female,85,10,3000.00,2,1,1,116537.96,0
2458,2459,15813303,Rearick,513,Spain,Male,88,10,3000.00,2,1,1,52952.24,0
6443,6444,15764927,Rogova,753,France,Male,92,3,124513.31,1,0,1,195563.99,0
6759,6760,15660878,T'ien,705,France,Male,92,1,129076.24,2,1,1,34436.83,0

In [27]:
df['N Bal'] = df['Balance'] + 10000
print(df.head(10))

      RowNumber  CustomerId          Surname  CreditScore Geography  Gender  \
1678       1679    15569178        Kharlamov          570    France  Female
4556       4557    15796231          Nwankwo          681    France  Female
9520       9521    15673180      Onyekaozulu          727   Germany  Female
9526       9527    15665521  Chiazagomekpele          642   Germany    Male
9572       9573    15641688          Collier          644     Spain    Male
2021       2022    15795519         Vasiliev          716   Germany  Female
2141       2142    15758372          Wallace          674    France    Male
2136       2137    15621893         Bellucci          727    France    Male
1619       1620    15770309         McDonald          656    France    Male
4716       4717    15805764         Hallahan          646    France    Male

      Age  Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
1678   18       4   85767.42              1          1               0
4556   18       1  101894.39              1          1               1
9520   18       2   96816.70              2          1               0
9526   18       5  114183.53              2          0               1
9572   18       7    3000.00              1          0               1
2021   18       3  131743.80              1          0               0
2141   18       7    3000.00              2          1               1
2136   18       4  136550.67              1          1               1
1619   18      10  154762.74              1          0               1
4716   18      10    3000.00              2          0               1

      EstimatedSalary  Exited  New Balance      N Bal
1678         71811.90       0     86767.42   95767.42
4556          9596.40       0    102894.39  111894.39
9520        126172.11       0     97816.70  106816.70
9526         10063.75       0    115183.53  124183.53
9572         59645.24       1      4000.00   13000.00
2021        197322.13       0    132743.80  141743.80
2141         55753.12       1      4000.00   13000.00
2136         46941.41       0    137550.67  146550.67
1619        127014.32       0    155762.74  164762.74
4716         52795.15       0      4000.00   13000.00

In [28]:
df.iloc[0:6 , 8:]

,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,New Balance,N Bal
1678,85767.42,1,1,0,71811.90,0,86767.42,95767.42
4556,101894.39,1,1,1,9596.40,0,102894.39,111894.39
9520,96816.70,2,1,0,126172.11,0,97816.70,106816.70
9526,114183.53,2,0,1,10063.75,0,115183.53,124183.53
9572,3000.00,1,0,1,59645.24,1,4000.00,13000.00
2021,131743.80,1,0,0,197322.13,0,132743.80,141743.80

### Combining Data Frames

Why?

In real-world data analysis, data rarely comes from one single clean file.
You often have multiple related datasets â€” like pieces of a puzzle â€” and you must combine them to get the full story.

an instance

students.csv â†’ has student names and IDs & 
marks.csv â†’ has student IDs and scores, here common is IDs

In [ ]:
# concat-> it stacks the info either row wise or row wise, merge-> its like sql's join combine df's using common columns.
# new_df = pd.concat([df1, df2])